X = ['จุฬาลักษณ์ คงจรูญ เลขที่1', 'ไตรคูน บุญนำ เลขที่2', 'วรนาศักดิ์ เกียรติพิเชฐชื่น เลขที่3', 'นนทวัฒน์ ขำดวง เลขที่4', 'ภาณุพงศ์ สายศร เลขที่5',
     'ปัณณกร พวงสวรรณ์ เลขที่6', 'วิศรุต กลิ่นเรื่อง เลขที่7', 'อมรเทพ อันโน เลขที่8', 'จักรกริช เทศทอง เลขที่9', 'จิรฐา น้อยศรี เลขที่10',
     'กรพิพัฒน์ เล็กนาก เลขที่11', 'ภัทรพล ชมพุฒ เลขที่12', 'ศุภชัย รุ่งแสง เลขที่13', 'ณัฐพล ปลื้มกิจมงคล เลขที่14', 'พลัษฎฐ์ ด่านอนันต์สุข เลขที่15',
     'เรืองวิทย์ โชคชัย เลขที่16', 'จิรายุธ บูรณะจันทร์ เลขที่17', 'ณัชชา คำภา เลขที่18', 'สาวิตรี มินสะมัน เลขที่19', 'บัณพร ศิริพันธ์ เลขที่20',
     'ญาณิศา พ่วงพี เลขที่21', 'กิตญาดา จิตรวิมลรัตน์ เลขที่22', 'สุดารัตน์ สวนยิ้ม เลขที่23', 'พลอยประภัส พิษรักษ์ เลขที่24', 'ทัศชนก สมัย เลขที่25',
     'แพรพิไล บุญครอง เลขที่26', 'กัลยภรณ์ สิทธิวงศ์ เลขที่27', 'กาญจน์เกล้า สิทโธ เลขที่28', 'กฤติมา เกียรติอาภรณ์ เลขที่29', 'อภิษฎา วชิรศรีสุนทรา เลขที่30',
     'ศิริกานต์ เบ้าตุ่น เลขที่31', 'กัญญวีย์ อุดมสารี เลขที่32', 'ณัฐริณีย์ ฉิมเรื่อง เลขที่33', 'พิชาภรณ์ มีโชคสม เลขที่34', 'กัลย์ณิศา รัตน์เรืองอุตม เลขที่35',
     'ชุดา สาริพันธ์ เลขที่36', 'กันตา ปิยะภัทรกุล เลขที่37', 'นภัสพรพรหม ตันชรากรณ์ เลขที่38', 'กิ่งกาญจน์ รวมพล เลขที่39', 'วชิราญาณ์ วชิระนาวิน เลขที่40']

print('รายชื่อสมาชิกห้อง 5/9 มีดังนี้:')
count = 0
for Y in X:
    if Y == 'แพรพิไล บุญครอง เลขที่26':
        continue
    print(Y)
    count += 1

print('>>>> มีเพื่อนในห้องรวม:',count, 'คน')
